vlm/base/Documents/бит_ПланОтгрузок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ПланОтгрузок</Name>
			<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ПланыОтгрузок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_НачалоПериода</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КонецПериода</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Ответственный</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Автор</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_Организация</Name>
					<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>бит_Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>бит_ДатаОтгрузки</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_НомерЗаказаКлиента</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_НомерЗаказаНаПроизводство</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_СрокИсполнения</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Клиент</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Номенклатура</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_КОтгрузке</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_ФактическиОтгружено</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Откл</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Недогрузка</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Перегрузка</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_ОсновнойМенеджер</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_Комментарий</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_МассаНетто</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_КодСтроки</Name>
							<Comment>// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_СрокИзготовления</Name>
							<Comment>исправление после сквозного</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/Documents/бит_ПланОтгрузок/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПорядокОформленияНакладныхОрдеров = Константы.ПорядокОформленияНакладныхРасходныхОрдеров.Получить();
	
	Если ПорядокОформленияНакладныхОрдеров = Перечисления.ПорядокОформленияНакладныхРасходныхОрдеров.СначалаОрдера Тогда
		Если Не ЗначениеЗаполнено(Объект.бит_Ответственный) Тогда
			Объект.бит_Ответственный = ПользователиКлиентСервер.ТекущийПользователь();	 
		КонецЕсли;
		
		Если Не Константы.ИспользоватьНесколькоОрганизаций.Получить() 
			И Не ЗначениеЗаполнено(Объект.бит_Организация) Тогда
			Объект.бит_Организация = Справочники.Организации.ОрганизацияПоУмолчанию(); 
		КонецЕсли;
	Иначе
		Отказ = Истина;
		ТекстСообщения = "Некорректно указан порядок оформления накладных,расходных ордеров!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Объект.бит_Автор = ПользователиКлиентСервер.ТекущийПользователь(); 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

#Область Универсальные

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);  
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)  
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры  

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()    
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры                              							  

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры  

&НаКлиенте 
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
    // Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

#КонецОбласти

#Область Локальные 
&НаКлиенте
Процедура бит_ИзменениеПериода(Команда)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Если ЗначениеЗаполнено(Объект.бит_НачалоПериода) Или ЗначениеЗаполнено(Объект.бит_КонецПериода) Тогда
		НачалоПериода = Объект.бит_НачалоПериода;
		КонецПериода = Объект.бит_КонецПериода;	
	Иначе
		НачалоПериода = ТекущаяДата();
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыПодбора.Вставить("КонецПериода", КонецПериода); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаДень", ПараметрыПодбора, ЭтотОбъект, , , , ОписаниеОповещения);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	НачалоПериода = НачалоНедели(РезультатВыбора.НачалоПериода);	
	КонецПериода = КонецНедели(РезультатВыбора.КонецПериода);
	ОкончаниеДляПроверки = КонецНедели(РезультатВыбора.НачалоПериода);
	Если КонецПериода = ОкончаниеДляПроверки Тогда
		Объект.бит_НачалоПериода = НачалоПериода;
		Объект.бит_КонецПериода = КонецПериода;
	Иначе 
		Объект.бит_НачалоПериода = НачалоПериода;
		Объект.бит_КонецПериода = ОкончаниеДляПроверки;
    КонецЕсли;
		
	ЭтаФорма.ОбновитьОтображениеДанных();
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&НаКлиенте
Процедура бит_Заполнить(Команда)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ТекстСообщения = "";
	
	Если Не (ЗначениеЗаполнено(Объект.бит_НачалоПериода) и ЗначениеЗаполнено(Объект.бит_КонецПериода)) Тогда
		ТекстСообщения = "Период не заполнен! ";	
	КонецЕсли;
	
	Если Не (ЗначениеЗаполнено(Объект.бит_Организация)) Тогда
		ТекстСообщения = ТекстСообщения + "Организация не указана! ";	
	КонецЕсли;
	
	Если ТекстСообщения = "" Тогда   
		Если Объект.бит_НачалоПериода > ТекущаяДата() Тогда
			Объект.бит_Товары.Очистить();
			бит_ПолучитьДанныеЗаполнеияСтратегияДо();
		Иначе
			бит_ПолучитьДанныеЗаполнеияСтратегияПосле();
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
КонецПроцедуры

&НаСервере
Процедура бит_ПолучитьДанныеЗаполнеияСтратегияДо()
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 + 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,   
		|	ЗаказКлиентаТовары.бит_СрокИзготовления КАК СрокИзготовления,
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
		|	ЗаказКлиента.Партнер КАК Партнер,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.бит_ВесНетто КАК бит_ВесНетто,
		|	ЗаказКлиента.Менеджер КАК Менеджер,
		|	ЗаказКлиента.Комментарий КАК Комментарий,
		|	ЗаказКлиента.Назначение КАК Назначение,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	ЕСТЬNULL(ЗаказКлиентаТовары.Упаковка.Числитель, 1) КАК УпаковкаЧислитель,
		|	ЕСТЬNULL(ЗаказКлиентаТовары.Упаковка.Знаменатель, 1) КАК УпаковкаЗнаменатель
		|ПОМЕСТИТЬ ВТ_ЗаказКлиента
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО (ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка)
		|ГДЕ
		|	ЗаказКлиентаТовары.ДатаОтгрузки >= &НачалоПериода
		|	И ЗаказКлиентаТовары.ДатаОтгрузки <= &КонецПериода
		|	И ЗаказКлиента.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказКлиента.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапасыИПотребностиОстатки.Заказ КАК Заказ,
		|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыИПотребностиОстатки.Назначение КАК Назначение
		|ПОМЕСТИТЬ ВТ_ЗапасыИПотребности
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности КАК ЗапасыИПотребностиОстатки
		|ГДЕ
		|	(ЗапасыИПотребностиОстатки.Заказ ССЫЛКА Документ.ЗаказНаПроизводство
		|			ИЛИ ЗапасыИПотребностиОстатки.Заказ ССЫЛКА Документ.ЗаказНаПроизводство2_2)
		|	И ЗапасыИПотребностиОстатки.Номенклатура В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказКлиента.Номенклатура КАК Номенклатура
		|			ИЗ
		|				ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента)
		|	И ЗапасыИПотребностиОстатки.Назначение В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказКлиента.Назначение КАК Назначение
		|			ИЗ
		|				ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаспоряженияНаОтгрузку.Номенклатура КАК Номенклатура,
		|	РаспоряженияНаОтгрузку.Распоряжение.Назначение КАК Назначение,
		|	РаспоряженияНаОтгрузку.Серия КАК Серия,
		|	РаспоряженияНаОтгрузку.Распоряжение КАК ДокументОтгрузки,
		|	РаспоряженияНаОтгрузку.КодСтроки КАК КодСтроки,
		|	- СУММА(РаспоряженияНаОтгрузку.КОформлению) КАК КОтгрузкеРасход
		|ПОМЕСТИТЬ ВТ_ТоварыКОтгрузке
		|ИЗ
		|	РегистрНакопления.РаспоряженияНаОтгрузку КАК РаспоряженияНаОтгрузку
		|ГДЕ
		|	РаспоряженияНаОтгрузку.Распоряжение В
		|			(ВЫБРАТЬ
		|				ВТ_ЗаказКлиента.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента)
		|	И РаспоряженияНаОтгрузку.КОформлению <= 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспоряженияНаОтгрузку.Номенклатура,
		|	РаспоряженияНаОтгрузку.Распоряжение.Назначение,
		|	РаспоряженияНаОтгрузку.Серия,
		|	РаспоряженияНаОтгрузку.Распоряжение,
		|	РаспоряженияНаОтгрузку.КодСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказКлиента.ДатаОтгрузки КАК Дата,  
		|	ВТ_ЗаказКлиента.СрокИзготовления КАК СрокИзготовления,
		|	ВТ_ЗаказКлиента.Ссылка КАК ЗаказКлиента,
		|	ВТ_ЗапасыИПотребности.Заказ КАК ЗаказНаПроизводство,
		|	ВТ_ЗаказКлиента.Партнер КАК Клиент,
		|	ВТ_ЗаказКлиента.Номенклатура КАК Номенклатура,
		|	ВТ_ЗаказКлиента.бит_ВесНетто КАК бит_ВесНетто,
		|	ВТ_ТоварыКОтгрузке.КОтгрузкеРасход / ВТ_ЗаказКлиента.УпаковкаЧислитель * ВТ_ЗаказКлиента.УпаковкаЗнаменатель КАК КОтгрузкеРасход,
		|	ВТ_ЗаказКлиента.бит_ВесНетто - ВТ_ТоварыКОтгрузке.КОтгрузкеРасход / ВТ_ЗаказКлиента.УпаковкаЧислитель * ВТ_ЗаказКлиента.УпаковкаЗнаменатель КАК Отклонение,
		|	ВТ_ЗаказКлиента.Менеджер КАК Менеджер,
		|	ВТ_ЗаказКлиента.КодСтроки КАК КодСтроки,
		|	ВТ_ЗаказКлиента.Комментарий КАК Комментарий
		|ИЗ
		|	ВТ_ТоварыКОтгрузке КАК ВТ_ТоварыКОтгрузке
		|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапасыИПотребности КАК ВТ_ЗапасыИПотребности
		|			ПО ВТ_ЗаказКлиента.Номенклатура = ВТ_ЗапасыИПотребности.Номенклатура
		|				И ВТ_ЗаказКлиента.Назначение = ВТ_ЗапасыИПотребности.Назначение
		|		ПО (ВТ_ЗаказКлиента.Номенклатура = ВТ_ТоварыКОтгрузке.Номенклатура)
		|			И (ВТ_ТоварыКОтгрузке.Назначение = ВТ_ЗаказКлиента.Назначение
		|				ИЛИ ВТ_ТоварыКОтгрузке.ДокументОтгрузки = ВТ_ЗаказКлиента.Ссылка)
		|			И (ВТ_ЗаказКлиента.КодСтроки = ВТ_ТоварыКОтгрузке.КодСтроки)";
	
	Запрос.УстановитьПараметр("КонецПериода", Объект.бит_КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.бит_НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТовары = Объект.бит_Товары.Добавить();
		СтрокаТовары.бит_ДатаОтгрузки = ВыборкаДетальныеЗаписи.Дата;   
		СтрокаТовары.бит_СрокИзготовления = ВыборкаДетальныеЗаписи.СрокИзготовления;   // исправление после сквозного
		СтрокаТовары.бит_НомерЗаказаКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
		СтрокаТовары.бит_НомерЗаказаНаПроизводство = ВыборкаДетальныеЗаписи.ЗаказНаПроизводство;
		//СтрокаТовары.бит_СрокИсполнения =
		СтрокаТовары.бит_Клиент = ВыборкаДетальныеЗаписи.Клиент;
		СтрокаТовары.бит_Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		СтрокаТовары.бит_КОтгрузке = ВыборкаДетальныеЗаписи.бит_ВесНетто;
		СтрокаТовары.бит_ФактическиОтгружено = ВыборкаДетальныеЗаписи.КОтгрузкеРасход;
		СтрокаТовары.бит_Откл = ВыборкаДетальныеЗаписи.Отклонение;
		Если СтрокаТовары.бит_Откл < 0 Тогда
			СтрокаТовары.бит_Перегрузка = - ВыборкаДетальныеЗаписи.Отклонение;
			СтрокаТовары.бит_Недогрузка = 0;
		ИначеЕсли СтрокаТовары.бит_Откл > 0 Тогда
			СтрокаТовары.бит_Недогрузка = ВыборкаДетальныеЗаписи.Отклонение;
			СтрокаТовары.бит_Перегрузка = 0;
		Иначе 
			СтрокаТовары.бит_Перегрузка = 0;
			СтрокаТовары.бит_Недогрузка = 0;
		КонецЕсли;	
		СтрокаТовары.бит_ОсновнойМенеджер = ВыборкаДетальныеЗаписи.Менеджер;
		СтрокаТовары.бит_Комментарий = ВыборкаДетальныеЗаписи.Комментарий;
		СтрокаТовары.бит_МассаНетто = ВыборкаДетальныеЗаписи.бит_ВесНетто;
		СтрокаТовары.бит_Откл = - СтрокаТовары.бит_Откл;
		СтрокаТовары.бит_КодСтроки = ВыборкаДетальныеЗаписи.КодСтроки;
	КонецЦикла;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 - 
КонецПроцедуры 

&НаСервере
Процедура бит_ПолучитьДанныеЗаполнеияСтратегияПосле()
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Если ЗначениеЗаполнено(Объект.Ссылка) и Объект.бит_Товары.Количество() > 0 Тогда
		
		МассивЗаказов = Объект.бит_Товары.Выгрузить(,"бит_НомерЗаказаКлиента");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаспоряженияНаОтгрузку.Номенклатура КАК Номенклатура,
		|	РаспоряженияНаОтгрузку.Распоряжение.Назначение КАК Назначение,
		|	РаспоряженияНаОтгрузку.Серия КАК Серия,
		|	РаспоряженияНаОтгрузку.Распоряжение КАК ДокументОтгрузки,
		|	РаспоряженияНаОтгрузку.КодСтроки КАК КодСтроки,
		|	-СУММА(РаспоряженияНаОтгрузку.КОформлению) КАК КОтгрузкеРасход
		|ИЗ
		|	РегистрНакопления.РаспоряженияНаОтгрузку КАК РаспоряженияНаОтгрузку
		|ГДЕ
		|	РаспоряженияНаОтгрузку.Распоряжение В(&МассивЗаказов)
		|	И РаспоряженияНаОтгрузку.КОформлению <= 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РаспоряженияНаОтгрузку.Номенклатура,
		|	РаспоряженияНаОтгрузку.Распоряжение.Назначение,
		|	РаспоряженияНаОтгрузку.Серия,
		|	РаспоряженияНаОтгрузку.Распоряжение,
		|	РаспоряженияНаОтгрузку.КодСтроки";
				
		Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Строка Из Объект.бит_Товары Цикл
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", Строка.бит_Номенклатура);
			ПараметрыОтбора.Вставить("Назначение", Строка.бит_НомерЗаказаКлиента.Назначение);	
			ПараметрыОтбора.Вставить("ДокументОтгрузки", Строка.бит_НомерЗаказаКлиента);
			ПараметрыОтбора.Вставить("КодСтроки", Строка.бит_КодСтроки);
			СтрокаВыборки = РезультатЗапроса.НайтиСтроки(ПараметрыОтбора);
			Если  СтрокаВыборки.Количество() > 0 Тогда
				Отгружено = СтрокаВыборки[0].КОтгрузкеРасход;
				СтрокаДокумента = Строка.бит_НомерЗаказаКлиента.Товары.Найти(Строка.бит_КодСтроки, "КодСтроки");
				УпаковкаЧислитель = ?(СтрокаДокумента.Упаковка.Числитель = Неопределено, 1, СтрокаДокумента.Упаковка.Числитель);    
				УпаковкаЗнаменатель = ?(СтрокаДокумента.Упаковка.Знаменатель = Неопределено, 1, СтрокаДокумента.Упаковка.Знаменатель); 
				УпаковкаЧислитель = ?(УпаковкаЧислитель = 0, 1, СтрокаДокумента.Упаковка.Числитель);    
				УпаковкаЗнаменатель = ?(УпаковкаЗнаменатель = 0, 1, СтрокаДокумента.Упаковка.Знаменатель);
				ФактическиОтгружено = Отгружено / УпаковкаЧислитель * УпаковкаЗнаменатель; 
				Строка.бит_ФактическиОтгружено = ФактическиОтгружено;
				Строка.бит_Откл = Строка.бит_КОтгрузке - Строка.бит_ФактическиОтгружено;
				Если Строка.бит_Откл < 0 Тогда
					Строка.бит_Перегрузка = - Строка.бит_Откл;
					Строка.бит_Недогрузка = 0;
				ИначеЕсли Строка.бит_Откл > 0 Тогда
					Строка.бит_Недогрузка = Строка.бит_Откл;
					Строка.бит_Перегрузка = 0;
				Иначе 
					Строка.бит_Перегрузка = 0;
					Строка.бит_Недогрузка = 0;
				КонецЕсли;
				Строка.бит_Откл = - Строка.бит_Откл;
			КонецЕсли;
		КонецЦикла;	
		ПараметрыОтбора = Новый Структура;
	Иначе	
		Объект.бит_Товары.Очистить();
		бит_ПолучитьДанныеЗаполнеияСтратегияДо();
	КонецЕсли;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры	
#КонецОбласти

#КонецОбласти

#Область ОбработчикиТекущихСобытий 

&НаКлиенте
Процедура бит_Товарыбит_КОтгрузкеПриИзменении(Элемент)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ТекущаяСтрока = Элементы.бит_Товары.ТекущиеДанные;
	ПересчетОтгрузНедогруз(ТекущаяСтрока);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры

&НаКлиенте
Процедура бит_Товарыбит_ФактическиОтгруженоПриИзменении(Элемент)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	ТекущаяСтрока = Элементы.бит_Товары.ТекущиеДанные;
	ПересчетОтгрузНедогруз(ТекущаяСтрока);
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры 

&НаКлиенте
Процедура ПересчетОтгрузНедогруз(ТекущаяСтрока)
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 +
	Расхожение = ТекущаяСтрока.бит_КОтгрузке - ТекущаяСтрока.бит_ФактическиОтгружено;
	ТекущаяСтрока.бит_Откл = Расхожение;
	Если Расхожение > 0 Тогда 
		ТекущаяСтрока.бит_Недогрузка = Расхожение;
	ИначеЕсли Расхожение < 0 Тогда
		ТекущаяСтрока.бит_Перегрузка = - Расхожение; 
	Иначе
		ТекущаяСтрока.бит_Недогрузка = 0;
		ТекущаяСтрока.бит_Перегрузка = 0;
	КонецЕсли;
	ТекущаяСтрока.бит_Откл = - ТекущаяСтрока.бит_Откл;
	ТекущаяСтрока.бит_МассаНетто = ТекущаяСтрока.бит_КОтгрузке;
	// Первыйбит ЛТ3.13 ЛапшовГ "GVLapshov@1cbit.ru" 01.04.2025 -
КонецПроцедуры	
#КонецОбласти
